



#εκτίμηση μέγιστης πιθανοφάνειας
data <-read.csv('Roullete Data 3.csv') 

low = seq(from = 19, to = 36, by = 1)
n = nrow(data) #μέγεθος δείγματος
sum=0
for (i in 1:n){
 if(data[i,1] %in% low){
   sum = sum + 1
 }
}
xbar=sum/n

#Διάστημα εμπιστοσύνης σημαντικότητας 0.05
#Ίσων ουρών
z = 1.9
k = (z/n)**2
Diak = (k + 2*xbar)**2 - (4*(k + 1)**2)*(xbar)**2

theta_1 = (k + 2*xbar - sqrt(Diak))/(2*(k + 1)**2)

theta_2 = (k + 2*xbar + sqrt(Diak))/(2*(k + 1)**2)


cat("Η εκτίμηση μέγιστης πιθανοφάνειας είναι", xbar, " και το ασυμπτωτικο διαστημα
    εμπιστοσυνης σημαντικότητος 95% ειναι ",
    sprintf("[%f,%f]", theta_1, theta_2))

#minimum length





#Έλεγχος Υποθέσεων
# H_0 : p = p_0, H_1 : p != p_0

p_0 = 18/37
a = 0.05 #επίπεδο σημαντικότητας

#ψάχνουμε c', τέτοιο ώστε F_Y(c') = 0.95,  όπου Υ = sum x_i ακολουθεί την διωνυμική(n ,p_0)
#με την βοήθεια ενός υπολογιστή π.χ. https://stattrek.com/online-calculator/binomial.aspx
#βρίσκουμε το σημείο αυτό

ct = 261

if ( sum > ct){
  print('Απορρίπτουμε την μηδενική υπόθεση, δηλαδή p = p_1')
} else {
  print('Δεχόμαστε την μηδενική υπόθεση, δηλαδή p = p_0')
}






